set_process_bg.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-09-21 四 23:34 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to set a shell process to background</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="Learn how to set a shell process to background in Linux and Unix. This is useful for running long-running commands without blocking the shell. You can also disown background processes so that they continue to run even after you exit the shell." />
<meta name="keywords" content="shell process, background process, disown, jobs" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bulma@0.9.4/css/bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">How to set a shell process to background</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd9d1d4c">1. Viewing background processes</a></li>
<li><a href="#org7ce50ba">2. Disowning background processes</a></li>
<li><a href="#org1472532">3. Example</a></li>
<li><a href="#orgc2c0e00">4. Conclusion</a></li>
</ul>
</div>
</nav>
<p>
Sometimes you need to run a long-running command in a shell,
but you also need to be able to exit the shell without canceling the command.
This is where backgrounding processes comes in.
</p>

<p>
Backgrounding a process means that the process will continue to run even
after you exit the shell. This can be useful for tasks such as running a web
server or downloading a large file.
</p>

<p>
To background a process, simply append an ampersand (&amp;) to the end of the
command. For example, to run the Python HTTP server in the background,
you would use the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">python -m http.server &amp;
</pre>
</div>

<p>
This will start the HTTP server, but the shell will not wait for it to finish
running.
You can then exit the shell without affecting the server.
</p>

<div id="outline-container-orgd9d1d4c" class="outline-2">
<h2 id="orgd9d1d4c"><span class="section-number-2">1.</span> Viewing background processes</h2>
<div class="outline-text-2" id="text-1">
<p>
To view a list of all the background processes that are currently running,
you can use the <code>jobs</code> command. This will display a list of process IDs (PIDs)
and command names.
</p>
</div>
</div>

<div id="outline-container-org7ce50ba" class="outline-2">
<h2 id="org7ce50ba"><span class="section-number-2">2.</span> Disowning background processes</h2>
<div class="outline-text-2" id="text-2">
<p>
By default, background processes are associated with the current shell session.
This means that if you exit the shell, the background processes will be terminated.
</p>

<p>
To prevent this, you can use the <code>disown</code> command to disown a background process.
This will remove the process from the current shell session,
so it will continue to run even if you exit the shell.
</p>

<p>
To disown a background process, simply use the disown command followed by the
PID of the process. For example, to disown the Python HTTP server that we
started earlier, we would use the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">disown %1
</pre>
</div>

<p>
This will disown the process with the PID 1.
</p>
</div>
</div>

<div id="outline-container-org1472532" class="outline-2">
<h2 id="org1472532"><span class="section-number-2">3.</span> Example</h2>
<div class="outline-text-2" id="text-3">
<p>
Here is an example of how to use backgrounding and disowning to run a
long-running command in a shell:
</p>

<div class="org-src-container">
<pre class="src src-bash"># Start the Python HTTP server
python -m http.server

# Ctrl+z

# View a list of all background processes
jobs

# Disown the Python HTTP server
disown %1

# Exit the shell
exit
</pre>
</div>

<p>
Now, even though we have exited the shell, the Python HTTP server will
continue to run in the background. We can check this by running the ps command:
</p>

<div class="org-src-container">
<pre class="src src-bash">ps aux | grep python
</pre>
</div>

<p>
This will show us a list of all Python processes that are currently running.
We should see the Python HTTP server process listed here.
</p>

<p>
We can now stop the Python HTTP server at any time by running the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">killall python
</pre>
</div>

<p>
This will kill all Python processes that are currently running.
</p>
</div>
</div>

<div id="outline-container-orgc2c0e00" class="outline-2">
<h2 id="orgc2c0e00"><span class="section-number-2">4.</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
Backgrounding and disowning processes are powerful tools that can be used to
run long-running commands in a shell without blocking the shell.
This can be useful for a variety of tasks, such as running web servers,
downloading large files, and processing data.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>